import * as S from './styles'

const DiaryDetailPosting = () : JSX.Element => {

  return (
    <S.PostingContainer>
      <S.Text>
        선거와 국민투표의 공정한 관리 및 정당에 관한 사무를 처리하기 위하여 선거관리위원회를 둔다. 대통령은 헌법과 법률이 정하는 바에 의하여 공무원을 임면한다.
        
        체포·구속·압수 또는 수색을 할 때에는 적법한 절차에 따라 검사의 신청에 의하여 법관이 발부한 영장을 제시하여야 한다. 다만, 현행범인인 경우와 장기 3년 이상의 형에 해당하는 죄를 범하고 도피 또는 증거인멸의 염려가 있을 때에는 사후에 영장을 청구할 수 있다.
        
        계엄을 선포한 때에는 대통령은 지체없이 국회에 통고하여야 한다. 의무교육은 무상으로 한다. 지방의회의 조직·권한·의원선거와 지방자치단체의 장의 선임방법 기타 지방자치단체의 조직과 운영에 관한 사항은 법률로 정한다.
        
        공무원의 신분과 정치적 중립성은 법률이 정하는 바에 의하여 보장된다. 국회는 국무총리 또는 국무위원의 해임을 대통령에게 건의할 수 있다. 국민의 모든 자유와 권리는 국가안전보장·질서유지 또는 공공복리를 위하여 필요한 경우에 한하여 법률로써 제한할 수 있으며, 제한하는 경우에도 자유와 권리의 본질적인 내용을 침해할 수 없다.
        
        국가는 농·어민과 중소기업의 자조조직을 육성하여야 하며, 그 자율적 활동과 발전을 보장한다. 원장은 국회의 동의를 얻어 대통령이 임명하고, 그 임기는 4년으로 하며, 1차에 한하여 중임할 수 있다.
      </S.Text>
      <S.Photo>
        {/* <S.Box></S.Box> */}
      </S.Photo>
      <S.Text>
        모든 국민은 법률이 정하는 바에 의하여 국가기관에 문서로 청원할 권리를 가진다. 모든 국민은 보건에 관하여 국가의 보호를 받는다. 국가원로자문회의의 조직·직무범위 기타 필요한 사항은 법률로 정한다.

        국회의원은 법률이 정하는 직을 겸할 수 없다. 헌법재판소 재판관은 탄핵 또는 금고 이상의 형의 선고에 의하지 아니하고는 파면되지 아니한다. 모든 국민은 인간으로서의 존엄과 가치를 가지며, 행복을 추구할 권리를 가진다. 국가는 개인이 가지는 불가침의 기본적 인권을 확인하고 이를 보장할 의무를 진다.

        군인 또는 군무원이 아닌 국민은 대한민국의 영역안에서는 중대한 군사상 기밀·초병·초소·유독음식물공급·포로·군용물에 관한 죄중 법률이 정한 경우와 비상계엄이 선포된 경우를 제외하고는 군사법원의 재판을 받지 아니한다.

        국무총리는 국회의 동의를 얻어 대통령이 임명한다. 재판의 심리와 판결은 공개한다. 다만, 심리는 국가의 안전보장 또는 안녕질서를 방해하거나 선량한 풍속을 해할 염려가 있을 때에는 법원의 결정으로 공개하지 아니할 수 있다.

        국가는 전통문화의 계승·발전과 민족문화의 창달에 노력하여야 한다. 제1항의 해임건의는 국회재적의원 3분의 1 이상의 발의에 의하여 국회재적의원 과반수의 찬성이 있어야 한다.
      </S.Text>
      <S.Lucy>
        <div>img</div>
        <div>12 LUCY</div>
      </S.Lucy>
    </S.PostingContainer>
  )
}

export default DiaryDetailPosting;